posts/20230428-ai-db-writing.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing on AI and Postgres</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans:wght@400;500;600;700&display=swap" rel="stylesheet">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/posts/20230428-ai-db-writing.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/posts/20230428-ai-db-writing.html">
<meta property="og:title" content="Writing on AI and Postgres">
<meta property="og:description" content="Since this start of this year, I&#39;ve been working on and writing about AI tools for working with Postgres databases. Most of this work has involved finding different ways to integrate ChatGPT (and p...">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2023-06-01T00:00:00Z">
<meta property="article:modified_time" content="2025-09-21T16:05:22Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Writing on AI and Postgres">
<meta name="twitter:description" content="Since this start of this year, I&#39;ve been working on and writing about AI tools for working with Postgres databases. Most of this work has involved finding different ways to integrate ChatGPT (and p...">
</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Writing on AI and Postgres</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga4212d7">Background</a></li>
<li><a href="#orgd3028e0">Making a Production LLM Prompt for Text-to-SQL Translation</a></li>
<li><a href="#orgde6a320">Make ChatGPT Stop Chatting and Start Writing SQL</a></li>
<li><a href="#org368e85d">LLM Prompt Testing Part 1: Comparing ChatGPT to Codex</a></li>
<li><a href="#orga9a2c8b">Use LLMs with Other Tools for Better SQL Translation</a></li>
<li><a href="#org150b1a6">Vector Similarity Search in Postgres with bit.io and pgvector</a></li>
<li><a href="#org0b61a25">Pre-Classify Tasks for Better ChatGPT Completions</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orga4212d7" class="outline-2">
<h2 id="orga4212d7">Background</h2>
<div class="outline-text-2" id="text-orga4212d7">
<div class="preview" id="orgf5032f6">
<p>
Since this start of this year, I've been working on and writing about AI tools
for working with Postgres databases. Most of this work has involved finding
different ways to integrate ChatGPT (and previously Codex) with other tools and
workflows. I wanted to collect and share some of that writing here, as it's
related to a lot of the other things I write about on my personal blog.
</p>

</div>
</div>
</div>


<div id="outline-container-orgd3028e0" class="outline-2">
<h2 id="orgd3028e0"><a href="https://innerjoin.bit.io/making-a-production-llm-prompt-for-text-to-sql-translation-b798b6e94783">Making a Production LLM Prompt for Text-to-SQL Translation</a></h2>
<div class="outline-text-2" id="text-orgd3028e0">
<p>
This article introduces our work on AI+databases. Our original goal was simple:
make a great natural language to SQL translation system. This article talks
about some of the challenges and opportunities in that area and introduces a
<a href="https://github.com/bitdotioinc/pg-text-query/tree/liden/test_suite/playground">Streamlit app</a> we put together for testing text-to-SQL translation prompts.
</p>
</div>
</div>
<div id="outline-container-orgde6a320" class="outline-2">
<h2 id="orgde6a320"><a href="https://innerjoin.bit.io/make-chatgpt-stop-chatting-and-start-writing-sql-fd5560049ae4">Make ChatGPT Stop Chatting and Start Writing SQL</a></h2>
<div class="outline-text-2" id="text-orgde6a320">
<p>
I wrote this article after the ChatGPT API was released. We started by using the
Codex code completion models but the much lower price of <code>gpt-3.5-turbo</code> made a
compelling case for switching to ChatGPT. This proved to be a timely article:
shortly after we published this article, OpenAI announced that they were
discontinuing the Codex model. This article provides a useful guide for using
ChatGPT to get much of the same functionality.
</p>
</div>
</div>
<div id="outline-container-org368e85d" class="outline-2">
<h2 id="org368e85d"><a href="https://innerjoin.bit.io/llm-sql-translation-prompt-testing-part-1-comparing-chatgpt-to-codex-78da57213ebe">LLM Prompt Testing Part 1: Comparing ChatGPT to Codex</a></h2>
<div class="outline-text-2" id="text-org368e85d">
<p>
This article presents a simple suite of text-to-SQL translations and compares
the performance of the Codex and ChatGPT models.
</p>
</div>
</div>
<div id="outline-container-orga9a2c8b" class="outline-2">
<h2 id="orga9a2c8b"><a href="https://innerjoin.bit.io/use-llms-with-other-tools-for-better-sql-translation-21e35de8f03e">Use LLMs with Other Tools for Better SQL Translation</a></h2>
<div class="outline-text-2" id="text-orga9a2c8b">
<blockquote>
<p>
The Unix Philosophy considers text streams a universal interface, and emphasizes
the composability of processes that act on text streams. This is what LLMs do:
they act on and return text streams.
</p>
</blockquote>

<p>
This article urges readers to think of how LLMs might interface with other
tools. As shown by projects such as LangChain and AutoGPT, their usefulness is
multiplied when they are integrated with other projects and tools, not just used
for chatting.
</p>
</div>
</div>
<div id="outline-container-org150b1a6" class="outline-2">
<h2 id="org150b1a6"><a href="https://innerjoin.bit.io/vector-similarity-search-in-postgres-with-bit-io-and-pgvector-c58ac34f408b">Vector Similarity Search in Postgres with bit.io and pgvector</a></h2>
<div class="outline-text-2" id="text-org150b1a6">
<p>
In this article, I briefly show how to use the <code>pgvector</code> Postgres extension for
semantic search. I exported all of bit.io's docs to a Postgres database, created
vector embeddings from the docs, and showed how to use <code>pgvector</code> to query the
embeddings. Then I used ChatGPT to generate summaries from the results of
semantic search applied to the docs.
</p>
</div>
</div>
<div id="outline-container-org0b61a25" class="outline-2">
<h2 id="org0b61a25"><a href="https://innerjoin.bit.io/pre-classify-tasks-for-better-chatgpt-completions-f197ad01618c">Pre-Classify Tasks for Better ChatGPT Completions</a></h2>
<div class="outline-text-2" id="text-org0b61a25">
<p>
In my most recent article, I described how we used a two-step process to
generate API calls using ChatGPT. We first used ChatGPT to identify the <i>task</i>
that the user wanted to complete, and then we combined the user prompt with a
task-specific prompt to generate API call completions. The task-specific prompt
left much less room for error and resulted in better completion quality.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-06-01 Thu 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
